apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_sha.c
static int esp32c3_sha1_block(struct esp32c3_sha1_context_s *ctx,
                              const uint8_t *data, size_t len,
                              uint8_t *buf, size_t buf_len)
{
  uint32_t *data_words = NULL;
  size_t blk_len = 0;
  size_t blk_word_len = 0;
  int num_block = 0;
  int i;
  int j;

  blk_len = 64;
  blk_word_len =  blk_len / 4;
  num_block = len / blk_len;

  putreg32(ctx->mode, SHA_MODE_REG);

  if (buf_len != 0)
    {
      data_words = (uint32_t *)buf;

      while (getreg32(SHA_BUSY_REG))
        {
        }

      for (i = 0; i < blk_word_len; i++)
        {
          putreg32(data_words[i], SHA_M_0_REG + i * 4);
        }

      if (ctx->first_block)
        {
          putreg32(1, SHA_START_REG);
        }
      else
        {
          putreg32(1, SHA_CONTINUE_REG);
        }

      ctx->first_block = false;
    }

  for (j = 0; j < num_block; j++)
    {
      data_words = (uint32_t *)(data + blk_len * j);

      while (getreg32(SHA_BUSY_REG))
        {
        }

      for (i = 0; i < blk_word_len; i++)
        {
          putreg32(data_words[i], SHA_M_0_REG + i * 4);
        }

      if (ctx->first_block)
        {
          putreg32(1, SHA_START_REG);
        }
      else
        {
          putreg32(1, SHA_CONTINUE_REG);
        }

      ctx->first_block = false;
    }

  while (getreg32(SHA_BUSY_REG))
    {
    }

  for (i = 0; i < 5; i++)
    {
      ctx->state[i] = getreg32(SHA_H_0_REG + i * 4);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_sha256_block
 *
 * Description:
 *   Performs SHA256 on multiple blocks at a time.
 *
 * Input Parameters:
 *   ctx      - The SHA256 context
 *   data     - Input message to be hashed on single block
 *   len      - Length of the input message on single block
 *   buf      - Input message to be hashed on multiple blocks
 *   buf_len  - Length of the input message on multiple blocks
 *
 * Returned Value:
 *   OK is returned on success.
 *
 ****************************************************************************/

static int esp32c3_sha256_block(struct esp32c3_sha256_context_s *ctx,
                                const uint8_t *data, size_t len,
                                uint8_t *buf, size_t buf_len)
{
  uint32_t *data_words = NULL;
  size_t blk_len = 0;
  size_t blk_word_len = 0;
  int num_block = 0;
  int i;
  int j;

  blk_len = 64;
  blk_word_len =  blk_len / 4;
  num_block = len / blk_len;

  putreg32(ctx->mode, SHA_MODE_REG);

  if (buf_len != 0)
    {
      data_words = (uint32_t *)buf;

      while (getreg32(SHA_BUSY_REG))
        {
        }

      for (i = 0; i < blk_word_len; i++)
        {
          putreg32(data_words[i], SHA_M_0_REG + i * 4);
        }

      if (ctx->first_block)
        {
          putreg32(1, SHA_START_REG);
        }
      else
        {
          putreg32(1, SHA_CONTINUE_REG);
        }

      ctx->first_block = false;
    }

  for (j = 0; j < num_block; j++)
    {
      data_words = (uint32_t *)(data + blk_len * j);

      while (getreg32(SHA_BUSY_REG))
        {
        }

      for (i = 0; i < blk_word_len; i++)
        {
          putreg32(data_words[i], SHA_M_0_REG + i * 4);
        }

      if (ctx->first_block)
        {
          putreg32(1, SHA_START_REG);
        }
      else
        {
          putreg32(1, SHA_CONTINUE_REG);
        }

      ctx->first_block = false;
    }

  while (getreg32(SHA_BUSY_REG))
    {
    }

  if (ctx->mode == ESP32C3_SHA2_256)
    {
      num_block = 8;
    }
  else
    {
      num_block = 7;
    }

  for (i = 0; i < num_block; i++)
    {
      ctx->state[i] = getreg32(SHA_H_0_REG + i * 4);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_sha512_block
 *
 * Description:
 *   Performs SHA512 on multiple blocks at a time.
 *
 * Input Parameters:
 *   ctx      - The SHA512 context
 *   data     - Input message to be hashed
 *
 * Returned Value:
 *   OK is returned on success.
 *
 ****************************************************************************/

static int esp32c3_sha512_block(struct esp32c3_sha512_context_s *ctx,
                                const uint8_t *data)
{
  int i;
  int j;
  uint64_t temp1, temp2, W[80];
  uint64_t A, B, C, D, E, F, G, H;

  for (i = 0; i < 16; i++)
    {
      GET_UINT64_BE(W[i], data, i << 3);
    }

  for (; i < 80; i++)
    {
      W[i] = S1(W[i -  2]) + W[i -  7] + S0(W[i - 15]) + W[i - 16];
    }

  A = ctx->state[0];
  B = ctx->state[1];
  C = ctx->state[2];
  D = ctx->state[3];
  E = ctx->state[4];
  F = ctx->state[5];
  G = ctx->state[6];
  H = ctx->state[7];
  i = 0;
  j = 0;

  do
    {
      P(A, B, C, D, E, F, G, H, W[i++], K[j++]);
      P(H, A, B, C, D, E, F, G, W[i++], K[j++]);
      P(G, H, A, B, C, D, E, F, W[i++], K[j++]);
      P(F, G, H, A, B, C, D, E, W[i++], K[j++]);
      P(E, F, G, H, A, B, C, D, W[i++], K[j++]);
      P(D, E, F, G, H, A, B, C, W[i++], K[j++]);
      P(C, D, E, F, G, H, A, B, W[i++], K[j++]);
      P(B, C, D, E, F, G, H, A, W[i++], K[j++]);
    }
  while (i < 80);

  ctx->state[0] += A;
  ctx->state[1] += B;
  ctx->state[2] += C;
  ctx->state[3] += D;
  ctx->state[4] += E;
  ctx->state[5] += F;
  ctx->state[6] += G;
  ctx->state[7] += H;

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32c3_sha1_init
 *
 * Description:
 *   Initializes a SHA-1 context.
 *
 * Input Parameters:
 *   ctx      - The SHA-1 context to initialize
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_sha1_init(struct esp32c3_sha1_context_s *ctx)
{
  memset(ctx, 0, sizeof(struct esp32c3_sha1_context_s));
}

/****************************************************************************
 * Name: esp32c3_sha1_starts
 *
 * Description:
 *   Starts a SHA-1 checksum calculation.
 *
 * Input Parameters:
 *   ctx      - The SHA-1 context to initialize
 *
 * Returned Value:
 *   OK is returned on success.
 *
 ****************************************************************************/

