apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_sha.c
  if (ilen == 0)
    {
      return OK;
    }

  left = ctx->total[0] & 0x3f;
  fill = 64 - left;

  ctx->total[0] += ilen;
  ctx->total[0] &= UINT32_MAX;

  if (ctx->total[0] < ilen)
    {
      ctx->total[1]++;
    }

  /* Check if any data pending from previous call to this API */

  if (left && ilen >= fill)
    {
      memcpy((void *) (ctx->buffer + left), input, fill);

      input    += fill;
      ilen     -= fill;
      left      = 0;
      local_len = 64;
    }

  len = (ilen / 64) * 64;

  if (len || local_len)
    {
      ret = nxmutex_lock(&g_sha_lock);
      if (ret < 0)
        {
          return ret;
        }

      if (ctx->sha_state == ESP32C3_SHA_STATE_INIT)
        {
          ctx->first_block = true;
          ctx->sha_state = ESP32C3_SHA_STATE_IN_PROCESS;
        }
      else if (ctx->sha_state == ESP32C3_SHA_STATE_IN_PROCESS)
        {
          ctx->first_block = false;
          int block_num = (ctx->mode == ESP32C3_SHA2_224) ? 7 : 8;
          for (i = 0; i < block_num; i++)
            {
              putreg32(ctx->state[i], SHA_H_0_REG + i * 4);
            }
        }

      ret = esp32c3_sha256_block(ctx, input, len,  ctx->buffer, local_len);
      ret |= nxmutex_unlock(&g_sha_lock);

      if (ret != 0)
        {
          return ret;
        }
    }

  if (ilen > 0)
    {
      memcpy((void *) (ctx->buffer + left), input + len, ilen - len);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_sha256_finish
 *
 * Description:
 *   Finishes the SHA-224 or SHA-256 operation, and writes the result to
 *   the output buffer.
 *
 * Input Parameters:
 *   ctx      - The SHA-256 context to use
 *   output   - The SHA-256 checksum result
 *
 * Returned Value:
 *   OK is returned on success.
 *   Otherwise, a negated errno value is returned.
 *
 ****************************************************************************/

int esp32c3_sha256_finish(struct esp32c3_sha256_context_s *ctx,
                          unsigned char output[32])
{
  int ret;
  uint32_t last;
  uint32_t padn;
  uint32_t high;
  uint64_t low;
  unsigned char msglen[8];

  high = (ctx->total[0] >> 29) | (ctx->total[1] << 3);
  low  = (ctx->total[0] << 3);

  PUT_UINT32_BE(high, msglen, 0);
  PUT_UINT32_BE(low,  msglen, 4);

  last = ctx->total[0] & 0x3f;
  padn = (last < 56) ? (56 - last) : (120 - last);

  ret = esp32c3_sha256_update(ctx, esp32c3_sha_padding, padn);
  if (ret != 0)
    {
      return ret;
    }

  ret = esp32c3_sha256_update(ctx, msglen, 8);
  if (ret != 0)
    {
      return ret;
    }

  memcpy(output, ctx->state, SHA2_BLK_SIZE);

  return ret;
}

/****************************************************************************
 * Name: esp32c3_sha256_free
 *
 * Description:
 *   Clears a SHA-256 context.
 *
 * Input Parameters:
 *   ctx      - The SHA-256 context to clear
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_sha256_free(struct esp32c3_sha256_context_s *ctx)
{
  if (ctx == NULL)
    {
      return;
    }

  memset(ctx, 0, sizeof(struct esp32c3_sha256_context_s));
}

/****************************************************************************
 * Name: esp32c3_sha512_init
 *
 * Description:
 *   Initializes a SHA-512 context.
 *
 * Input Parameters:
 *   ctx      - The SHA-512 context to initialize
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_sha512_init(struct esp32c3_sha512_context_s *ctx)
{
  memset(ctx, 0, sizeof(struct esp32c3_sha512_context_s));
}

/****************************************************************************
 * Name: esp32c3_sha512_starts
 *
 * Description:
 *   Starts a SHA-384 or SHA-512 checksum calculation.
 *
 * Input Parameters:
 *   ctx      - The SHA-512 context to initialize
 *   is384    - Determines which function to use
 *
 * Returned Value:
 *   OK is returned on success.
 *
 ****************************************************************************/

int esp32c3_sha512_starts(struct esp32c3_sha512_context_s *ctx, bool is384)
{
  int ret = 0;

  if (is384)
    {
      ctx->mode = ESP32C3_SHA3_384;

      ctx->total[0] = 0;
      ctx->total[1] = 0;

      ctx->state[0] = UINT64_C(0xcbbb9d5dc1059ed8);
      ctx->state[1] = UINT64_C(0x629a292a367cd507);
      ctx->state[2] = UINT64_C(0x9159015a3070dd17);
      ctx->state[3] = UINT64_C(0x152fecd8f70e5939);
      ctx->state[4] = UINT64_C(0x67332667ffc00b31);
      ctx->state[5] = UINT64_C(0x8eb44a8768581511);
      ctx->state[6] = UINT64_C(0xdb0c2e0d64f98fa7);
      ctx->state[7] = UINT64_C(0x47b5481dbefa4fa4);
    }
  else
    {
      ctx->mode = ESP32C3_SHA3_512;

      ctx->total[0] = 0;
      ctx->total[1] = 0;

      ctx->state[0] = UINT64_C(0x6a09e667f3bcc908);
      ctx->state[1] = UINT64_C(0xbb67ae8584caa73b);
      ctx->state[2] = UINT64_C(0x3c6ef372fe94f82b);
      ctx->state[3] = UINT64_C(0xa54ff53a5f1d36f1);
      ctx->state[4] = UINT64_C(0x510e527fade682d1);
      ctx->state[5] = UINT64_C(0x9b05688c2b3e6c1f);
      ctx->state[6] = UINT64_C(0x1f83d9abfb41bd6b);
      ctx->state[7] = UINT64_C(0x5be0cd19137e2179);
    }

  return ret;
}

/****************************************************************************
 * Name: esp32c3_sha512_update
 *
 * Description:
 *   Feeds an input buffer into an ongoing SHA-384 or SHA-512
 *   checksum calculation.
 *
 * Input Parameters:
 *   ctx      - The SHA-512 context to use
 *   input    - The buffer holding the input data
 *   ilen     - The length of the input data in Bytes
 *
 * Returned Value:
 *   OK is returned on success.
 *
 ****************************************************************************/

int esp32c3_sha512_update(struct esp32c3_sha512_context_s *ctx,
                          const unsigned char *input,
                          size_t ilen)
{
  size_t fill;
  uint32_t left;
  const uint8_t *input_buffer = (const uint8_t *)input;

